[
  {
    "title": "6: Conflict in the tech office",
    "description": "This week we discuss identifying and dealing with conflict in the tech work place. Discover your attitude to conflict resolution via the Thomas-Kilman personality assessment (for conflict):",
    "link": "https://theassessmentsite.com/?gclid=CjwKCAjwt7SWBhAnEiwAx8ZLaoWoVepNiWi3Q1omln9zlPvS7HNJKq7MCCUmaLoWiHgRvqQrHYnL9xoCyfUQAvD_BwE",
    "linkDescription": "Check out the assessment",
    "url": "https://open.spotify.com/episode/2rPwaoZimxs7dpv2GwahF2"
  },
  {
    "title": "5: How to get into the Tech Industry",
    "description": "In this weeks episode of the Life in Tech podcast Jay and Saad discuss the best ways to get into the tech industry. This episode is a real gem for anyone looking to enter or transition into the technology sector.",
    "url": "https://open.spotify.com/episode/55EauwBMOgnCU1LEnztl4y"
  },
  {
    "title": "4: Batsirai Madzonga: What does a Head of UX Design actually do?",
    "description": "In this weeks episode we talk to Batsirai Madzonga, Head of UX Design at Al Hilal Bank in Abu Dhabi. In this insightful episode Batsirai talks us through his journey to the top of the UX Design field and about life being a designer in the UAE as well as, the future of design systems and running a design business in hyper inflationary Zimbabwe. To find out more about Batsirai check him out on LinkedIn https://www.linkedin.com/in/batsi",
    "url": "https://open.spotify.com/episode/3ZouEKuL5btSiAkENtzQt8"
  },
  {
    "title": "3: Design Engineer: The future of tech",
    "description": "In this week's episode of the Life in Tech podcast with Jay and Saad, we discuss why we believe that the (somewhat mythical) role of the Design Engineer is the future of the Tech industry.",
    "url": "https://open.spotify.com/episode/42dGqgAZak6dN112XLLVfE"
  },
  {
    "title": "2: Boosting team morale in the tech industry",
    "description": "In this episode Jay and Saad discuss how to boost Tech (or any) team morale. How Leaders and colleagues can support their team members and allow them to gain confidence and give them space to perform at their very best.",
    "url": "https://open.spotify.com/episode/27tPFs0j28a7vKJ1BMJRRn"
  },
  {
    "title": "1: Is remote work really working?",
    "description": "In this weeks episode Jay and Saad discuss their experiences working remote in tech industry.",
    "url": "https://open.spotify.com/episode/7HkPxbzehf1QJDGBTqBCKV"
  }
]
